package de.telran.lesson9.practice;

public class Unary {
    public static void main(String[] args) {
        int myInt = 1;
        System.out.println("myInt = "+ myInt);
        System.out.println("myInt-- "+ myInt--);
        System.out.println("myInt = "+ myInt);
        System.out.println("--myInt "+ --myInt);
        System.out.println("myInt = "+ myInt);
    }
}

//        Создайте класс Unary
//        Создайте переменную с положительным знаком
//        Измените знак на отрицательный используя унарный минус
//        Результат распечатайте в консоле
